Revit 2027 API
PerformanceAdviser.GetRuleName(PerformanceAdviserRuleId) Method
 Retrieves the name of the rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetRuleName(
	PerformanceAdviserRuleId id
)
Public Function GetRuleName (
	id As PerformanceAdviserRuleId
) As String
public:
String^ GetRuleName(
	PerformanceAdviserRuleId^ id
)
member GetRuleName :
        id : PerformanceAdviserRuleId -> string
Parameters
id PerformanceAdviserRuleId
 The rule id to get information for.
Return Value
String
 The name of the rule.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PerformanceAdviser Class
GetRuleName Overload
Autodesk.Revit.DB Namespace